# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

#+latex: \newcommand{\mytitle}{Tipos de Dados, Declaração e tipos de variáveis, Operadores e expressão aritmética e lógica}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* Exemplo do uso de operadores aritméticos

#+BEGIN_SRC C :tangle e/exemplo-operadores-aritmeticos.c
/* Programa para ilustrar funcionamento dos operadores aritmeticos */
#include <stdio.h>
int main ()
{
  int val_1, val_2;
  int divisao, resto;

  val_1 = 13;
  val_2 = 5;
  divisao = val_1 / val_2;
  resto = val_1 % val_2;
  printf("Divisao inteira = %d Resto = %d\n", divisao, resto);
  return 0;
}
#+END_SRC

#+begin_src shell :results output :dir e
gcc exemplo-operadores-aritmeticos.c -o exemplo-operadores-aritmeticos
./exemplo-operadores-aritmeticos
#+end_src

#+RESULTS:
: Divisão inteira = 2 Resto = 3

** Com botes de 23 lugares

 #+BEGIN_SRC C
int passageiros = 950;
int lugares_no_bote = 23;
printf("%d %d\n",
       passageiros / lugares_no_bote,
       passageiros % lugares_no_bote);
 #+END_SRC

 #+RESULTS:
 : 41 7

** Com botes de 25 lugares

 #+BEGIN_SRC C
int passageiros = 950;
int lugares_no_bote = 25;
printf("%d %d\n",
       passageiros / lugares_no_bote,
       passageiros % lugares_no_bote);
 #+END_SRC

 #+RESULTS:
 : 38 0

* Relação entre tipos e expressões aritméticas

Vejams um exemplo representativo

#+BEGIN_SRC C :tangle e/exemplo-tipos-expressoes-aritmeticas.c
/* Exemplo para ilustrar um problema com expressoes aritmeticas */
#include<stdio.h>
int main()
{
  float num_real;
  int x=1, y=2, z=1;

  num_real = x/2 + y/2 + z/2;

  printf("Resultado: [%f]\n", num_real);
  return 0;
}
#+END_SRC

Qual é o resultado?

#+latex: \pause

#+begin_src shell :exports both :dir e
gcc exemplo-tipos-expressoes-aritmeticas.c -o exemplo-tipos-expressoes-aritmeticas
./exemplo-tipos-expressoes-aritmeticas
#+end_src

#+RESULTS:
: Resultado: [1.000000]

#+latex: \pause\vfill

#+begin_center
Constatação: resultados parciais são do tipo inteiro
#+end_center

#+latex: %\cortesia{../../../Algoritmos/Marcelo/aulas/aula03/aula03_slide_26.pdf}{Prof. Marcelo Walter}

* Modeladores (/casts/) para explicitamente trocar o tipo

#+BEGIN_SRC C :tangle e/exemplo-tipos-expressoes-aritmeticas-cast.c
/* Exemplo para ilustrar um problema com expressoes aritmeticas */
#include <stdio.h>
int main()
{
  float num_real_0, num_real_1, num_real_2, num_real_3;  // variaveis reais
  int x=1, y=2, z=1; // valores inteiros – inicializados na declaracao

  num_real_0 = x/2        + y/2        +        z/2;
  num_real_1 = (float)x/2 + y/2        +        z/2;
  num_real_2 = (float)x/2 + (float)y/2 +        z/2;
  num_real_3 = (float)x/2 + (float)y/2 + (float)z/2;

  printf("Resultados -> "
	 "C0: [%f] "
	 "C1: [%f] "
	 "C2: [%f] "
	 "C3: [%f]\n", num_real_0, num_real_1, num_real_2, num_real_3);
  return 0;
}
#+END_SRC

#+latex: \pause\scriptsize

#+begin_src shell :results output :dir e
gcc exemplo-tipos-expressoes-aritmeticas-cast.c -o exemplo-tipos-expressoes-aritmeticas-cast
./exemplo-tipos-expressoes-aritmeticas-cast
#+end_src

#+RESULTS:
: Resultados -> C0: [1.000000] C1: [1.500000] C2: [1.500000] C3: [2.000000]

